# MAT281 - Laboratorio N°03

## Problema 01


<img src="https://imagenes.universia.net/gc/net/images/practicas-empleo/p/pr/pro/profesiones-con-el-avance-de-la-tecnologia.jpg" width="480" height="360" align="center"/>


EL conjunto de datos se denomina `ocupation.csv`, el cual contiene información de distintos usuarios (edad ,sexo, profesión, etc.).

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [30]:
import pandas as pd
import os

In [49]:
# cargar datos
df = pd.read_csv(os.path.join("ocupation.csv"), sep="|")
df.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1.- ¿Cuál es el número de observaciones en el conjunto de datos?

In [50]:
len(df)

943

2.- ¿Cuál es el número de columnas en el conjunto de datos?

In [34]:
len(df.columns)

5

3.- Imprime el nombre de todas las columnas

In [51]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

4.- Imprima el índice del dataframe

In [36]:
df.index

RangeIndex(start=0, stop=943, step=1)

5.- ¿Cuál es el tipo de datos de cada columna?

In [16]:
df.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

6.- Describir el conjunto de datos (**hint**: .describe())

In [37]:
df.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

7.- Imprimir solo la columna de **occupation**.

In [42]:
df["occupation"]

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: object

8.- ¿Cuántas ocupaciones diferentes hay en este conjunto de datos?

In [52]:
ocup=[]
for i in df["occupation"]:
    if i not in ocup:
        ocup.append(i)        
print("la cantidad de ocupaciones distintas son:",len(ocup))

la cantidad de ocupaciones distintas son: 21

9.- ¿Cuál es la ocupación más frecuente?

In [63]:
d={}
for i in df["occupation"]:
    if i not in d:
        d[i]=1
    else:
        d[i]+=1
c=0
for i in d.values():
    if i>c:
        c=i
for i in d.keys():
    if d[i]==c:
        print("La ocupación más frecuente es:",i)

La ocupación más frecuente es: student

10.- ¿Cuál es la edad media de los usuarios?

In [74]:
df["age"].mean()

34.05196182396607

11.- ¿Cuál es la edad con menos ocurrencia?

In [121]:
d2={}
for i in df["age"]:
    if i not in d2:
        d2[i]=1
    else:
        d2[i]+=1
s=pd.Series(d2.values(),d2.keys())
s1=pd.Series(d2.values(),d2.keys())
n=s.sort_values(ascending = True)

ng=s1.sort_values(ascending = False)

#print(n)
#print(ng)
l=[]
for i in n.values:
    if i<=ng.values:
        l.append(n.index)

ValueError: The truth value of an array with more than one element is ambiguous. Use a.any() or a.all()

12.- Encontrar la edad promedio según la variable **occupation**

## Problema 02


<img src="https://image.freepik.com/vector-gratis/varios-automoviles-dibujos-animados_23-2147613095.jpg" width="360" height="360" align="center"/>


EL conjunto de datos se denomina `Automobile_data.csv`, el cual contiene información tal como: compañia, precio, kilometraje, etc.

Lo primero es cargar el conjunto de datos y ver las primeras filas que lo componen:

In [158]:
# cargar datos
df2 = pd.read_csv(os.path.join("Automobile_data.csv")).set_index('index')
df2.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

El objetivo es tratar de obtener la mayor información posible de este conjunto de datos. Para cumplir este objetivo debe resolver las siguientes problemáticas:

1. Elimine los valores nulos (Nan)

In [162]:
mask = lambda df2: df2.notnull().all(axis=1)
df2=df2[mask]
df2.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
0,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,13495.0
1,alfa-romero,convertible,88.6,168.8,dohc,four,111,21,16500.0
2,alfa-romero,hatchback,94.5,171.2,ohcv,six,154,19,16500.0
3,audi,sedan,99.8,176.6,ohc,four,102,24,13950.0
4,audi,sedan,99.4,176.6,ohc,five,115,18,17450.0

2. Encuentra el nombre de la compañía de automóviles más cara

In [226]:
df2=df2.sort_values("price")
df2.tail()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
15,bmw,sedan,110.0,197.0,ohc,six,182,15,36880.0
62,porsche,convertible,89.5,168.9,ohcf,six,207,17,37028.0
46,mercedes-benz,sedan,120.9,208.1,ohcv,eight,184,14,40960.0
14,bmw,sedan,103.5,193.8,ohc,six,182,16,41315.0
47,mercedes-benz,hardtop,112.0,199.2,ohcv,eight,184,14,45400.0

In [234]:
print("La compañía más cara es:",df2["company"][46])

La compañía más cara es: mercedes-benz

3. Imprimir todos los detalles de Toyota Cars

In [241]:
j=0
for i in df2["company"]:
    if i=="toyota":
        print(df2["body-style"][j],df2["wheel-base"][j],df2["length"][j],df2["engine-type"][j],df2["num-of-cylinders"][j],df2["horsepower"][j],df2["average-mileage"][j],df2["price"][j])
    j+=1

hatchback 94.5 171.2 ohcv six 154 19 16500.0

KeyError: 8

4. Cuente el total de automóviles por compañía

5. Encuentra el coche con el precio más alto por compañía

6. Encuentre el kilometraje promedio (**average-mileage**) de cada compañía automotriz

7. Ordenar todos los autos por columna de precio (**price**)

In [242]:
df2=df2.sort_values("price")
df2.head()

,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
index,,,,,,,,,
16,chevrolet,hatchback,88.4,141.1,l,three,48,47,5151.0
36,mazda,hatchback,93.1,159.1,ohc,four,68,30,5195.0
66,toyota,hatchback,95.7,158.7,ohc,four,62,35,5348.0
49,mitsubishi,hatchback,93.7,157.3,ohc,four,68,37,5389.0
37,mazda,hatchback,93.1,159.1,ohc,four,68,31,6095.0

## Problema 03


Siguiendo la temática de los automóviles, resuelva los siguientes problemas:

### a) Subproblema 01
A partir de los siguientes diccionarios:

In [ ]:
GermanCars = {'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400]}
japaneseCars = {'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
* Concatene ambos dataframes (**carsDf**) y añada una llave ["Germany", "Japan"], según corresponda.

In [276]:
carsDf1= pd.DataFrame(
    {
        'Company': ['Ford', 'Mercedes', 'BMV', 'Audi'],
              'Price': [23845, 171995, 135925 , 71400],
    }
)

carsDf2 = pd.DataFrame(
    {
       'Company': ['Toyota', 'Honda', 'Nissan', 'Mitsubishi '], 
                'Price': [29995, 23600, 61500 , 58900]
    },
    
)
carsDf= pd.DataFrame(
    [
        [carsDf1, carsDf2]
    ], 
    columns=["Germany","Japan"])

,Germany,Japan
0,Company Price 0 Ford 23845 1 Mer...,Company Price 0 Toyota 29995 1 ...

### b) Subproblema 02

A partir de los siguientes diccionarios:

In [ ]:
Car_Price = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'Price': [23845, 17995, 135925 , 71400]}
car_Horsepower = {'Company': ['Toyota', 'Honda', 'BMV', 'Audi'], 'horsepower': [141, 80, 182 , 160]}

* Cree dos dataframes (**carsDf1** y **carsDf2**) según corresponda.
*  Junte ambos dataframes (**carsDf**) por la llave **Company**.